{
  "name": "Saeed Saadatifar",
  "headerLinkProjects": "Projects",
  "headerLinkAboutMe": "About Me",
  "headerLinkContact": "Contact",
  "send-email": "Send Email",
  "hi-i-am-saeed": "Hi, I am Saeed",
  "description-me-banner": "A Front-End Developer & I learn Vue and React",
  "download-cv": "Download CV",
  "projects-portfolio": "Projects Portfolio",
  "projects-portfolio-0": "Projects Portfolio",
  "search-projects": "Search projects by title or filter them by category",
  "search-projects-placeHolder": "Search Projects",
  "all-projects-select": "All Projects",
  "web-application-select": "Web Application",
  "mini-project-select": "Mini Project",
  "no-founded-project": "No Founded Project",
  "omega-messenger": "Omega Messenger",
  "scrum-pocker": "Scrum Pocker",
  "todo-list": "ToDo List",
  "follow-me": "Follow me",
  "footer-copyRight": "Vue.js & Tailwind CSS Portfolio",
  "developed-by": "Developed by",
  "contact-details": "Contact details",
  "address": "North Bahonar St - North Bahonar 8 Ave - Number 176, Neyshabur City, Iran",
  "bio-line-1": "Hi, I am Saeed Saadatifar ,I have 23 Years Old and I live in Neyshabour City but I have no problem with living in another city and i live in Mashhad Now.",
  "bio-line-2": "I am Frontend Developer 👨‍💻, I am good at \"HTML\" , \"CSS\" , \"JS\" , \"ReactJs\" , \"Zustand\" , \"NextJs\" , \"React Router\" , \"VueJs\" , \"Pinia\" , \"NuxtJs\" , \"Vue Router\" , \"Material UI\" , \"TailwindCss\". I have Bachelor of Engineering from Shahrood University of Technology, I learn Many Programing Language For Ex: C++, Java, Python.",
  "bio-line-3": "I Love programing😎",
  "bio-line-4": "I am Achieving My Goals💯",
  "years-of-experience": "Years of experience",
  "projects-completed": "Projects completed",
  "client-heading": "Some of the brands I have worked with",
  "todolist-date": "Aug 28, 2023",
  "react-frontend": "React / Frontend",
  "about-client-single-project": "About Software",
  "name-single-project": "Name",
  "category": "Category",
  "website": "Website",
  "programmer": "Programmer",
  "objective": "Objective",
  "objective-description-todolist": "The purpose of writing this project was to practice more and learn state management for React, which I think turned out to be a good job.",
  "tools-and-technologies": "Tools & Technologies",
  "share-this": "Related Links",
  "challenge": "Challenges",
  "todolist-challenge-line-1": "This project was not a special challenge for me because I had memorized all its topics, but to practice the state management, I started such a project.",
  "todolist-challenge-line-2": "The only new thing for me in this project was the use of Zastand's state management library, which is really similar to Pinia in the Vue framework, and at the same time, it is very simple and efficient.",
  "todolist-challenge-line-3": "Of course, as you can see, this program is visually and graphically weak, but for me, this project was not strong enough to sit down and develop it, although I may have done so in the future.",
  "scrumpocker-date": "Dec 15, 2023",
  "vue-frontend": "Vue / Frontend",
  "objective-description-scrumpocker": "The purpose of writing this program is to provide an easier and systematic solution for scoring Scrum method sprints, which you can easily score team tasks with.",
  "scrumpocker-challenge-line-1": "In this project, I faced a major challenge, and my challenge was what to do for the back-end of the project and what method to choose, because I was not a back-end developer, it was really difficult for me to start learning back-end topics in order to find a solution. to arrive But I didn't stop and after a little research and of course help from my good friend Mr. Ghasemzadeh, I was introduced to Telefunc API, which solved my needs well, but there was still a problem, when the server was disconnected, the data was also deleted with it, which should be I managed it using a SQL database.",
  "scrumpocker-challenge-line-2": "It can almost be said that according to the chat project that I did, a series of front-end topics and topics remained, such as making the site multilingual and... well, in this project, almost those remaining topics were also worked on, and it was a very good experience after the project. It brought me chat and I am happy about it.",
  "scrumpocker-challenge-line-3": "Of course, there are a few minor things left, such as adding animations for movements, etc., which I will gradually complete and finally create a complete and neat project and deliver it.",
  "scrumpocker-challenge-line-4": "Finally, after the complete completion of the project, I plan to make a PW version of the project and publish it in the Android and Windows versions in order to pass on this good experience of systematizing the scoring of sprints to others.",
  "omegamessenger-date": "Aug 1, 2023",
  "objective-description-omegamessenger": "My goal in doing this project was to learn the front-end topics comprehensively. Now, at first, I wrote this project with React, and later, to learn the Vue framework, I coded the same project again with Vue, and I gained good skills.",
  "omegamessenger-challenge-line-1": "My main challenge for this project was my lack of experience and skills, which started at the same time as this project, my specialized training in front-end, and this was a difficult experience for me, but really a good goal to challenge and develop my skills. it was me The good thing about this project was that almost most of the content of the front-end field was used, and in addition to the challenge, it was also a good training for me.",
  "omegamessenger-challenge-line-2": "The next challenge for me was that they gave me a little time, and the styles and graphics of the program were like that.",
  "omegamessenger-challenge-line-3": "But finally, after three weeks passed after my specialized training, I finished this project and you can see the output.",
  "omegamessenger-challenge-line-4": "But this project taught me a very good lesson, even though I had taken a new step in the front-end field, this project included most of the front-end topics and I gained good experience in these fields at first."
}
